docs: remove theme mermaid
